GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.h
// Register: T4AINPPS
#define T4AINPPS T4AINPPS
extern volatile unsigned char           T4AINPPS            __at(0x1E9D);
#ifndef _LIB_BUILD
asm("T4AINPPS equ 01E9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4AINPPS               :5;
    };
    struct {
        unsigned T4AINPPS0              :1;
        unsigned T4AINPPS1              :1;
        unsigned T4AINPPS2              :1;
        unsigned T4AINPPS3              :1;
        unsigned T4AINPPS4              :1;
    };
} T4AINPPSbits_t;
extern volatile T4AINPPSbits_t T4AINPPSbits __at(0x1E9D);
// bitfield macros
#define _T4AINPPS_T4AINPPS_POSN                             0x0
#define _T4AINPPS_T4AINPPS_POSITION                         0x0
#define _T4AINPPS_T4AINPPS_SIZE                             0x5
#define _T4AINPPS_T4AINPPS_LENGTH                           0x5
#define _T4AINPPS_T4AINPPS_MASK                             0x1F
#define _T4AINPPS_T4AINPPS0_POSN                            0x0
#define _T4AINPPS_T4AINPPS0_POSITION                        0x0
#define _T4AINPPS_T4AINPPS0_SIZE                            0x1
#define _T4AINPPS_T4AINPPS0_LENGTH                          0x1
#define _T4AINPPS_T4AINPPS0_MASK                            0x1
#define _T4AINPPS_T4AINPPS1_POSN                            0x1
#define _T4AINPPS_T4AINPPS1_POSITION                        0x1
#define _T4AINPPS_T4AINPPS1_SIZE                            0x1
#define _T4AINPPS_T4AINPPS1_LENGTH                          0x1
#define _T4AINPPS_T4AINPPS1_MASK                            0x2
#define _T4AINPPS_T4AINPPS2_POSN                            0x2
#define _T4AINPPS_T4AINPPS2_POSITION                        0x2
#define _T4AINPPS_T4AINPPS2_SIZE                            0x1
#define _T4AINPPS_T4AINPPS2_LENGTH                          0x1
#define _T4AINPPS_T4AINPPS2_MASK                            0x4
#define _T4AINPPS_T4AINPPS3_POSN                            0x3
#define _T4AINPPS_T4AINPPS3_POSITION                        0x3
#define _T4AINPPS_T4AINPPS3_SIZE                            0x1
#define _T4AINPPS_T4AINPPS3_LENGTH                          0x1
#define _T4AINPPS_T4AINPPS3_MASK                            0x8
#define _T4AINPPS_T4AINPPS4_POSN                            0x4
#define _T4AINPPS_T4AINPPS4_POSITION                        0x4
#define _T4AINPPS_T4AINPPS4_SIZE                            0x1
#define _T4AINPPS_T4AINPPS4_LENGTH                          0x1
#define _T4AINPPS_T4AINPPS4_MASK                            0x10

// Register: T6AINPPS
#define T6AINPPS T6AINPPS
extern volatile unsigned char           T6AINPPS            __at(0x1E9E);
#ifndef _LIB_BUILD
asm("T6AINPPS equ 01E9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6AINPPS               :5;
    };
    struct {
        unsigned T6AINPPS0              :1;
        unsigned T6AINPPS1              :1;
        unsigned T6AINPPS2              :1;
        unsigned T6AINPPS3              :1;
        unsigned T6AINPPS4              :1;
    };
} T6AINPPSbits_t;
extern volatile T6AINPPSbits_t T6AINPPSbits __at(0x1E9E);
// bitfield macros
#define _T6AINPPS_T6AINPPS_POSN                             0x0
#define _T6AINPPS_T6AINPPS_POSITION                         0x0
#define _T6AINPPS_T6AINPPS_SIZE                             0x5
#define _T6AINPPS_T6AINPPS_LENGTH                           0x5
#define _T6AINPPS_T6AINPPS_MASK                             0x1F
#define _T6AINPPS_T6AINPPS0_POSN                            0x0
#define _T6AINPPS_T6AINPPS0_POSITION                        0x0
#define _T6AINPPS_T6AINPPS0_SIZE                            0x1
#define _T6AINPPS_T6AINPPS0_LENGTH                          0x1
#define _T6AINPPS_T6AINPPS0_MASK                            0x1
#define _T6AINPPS_T6AINPPS1_POSN                            0x1
#define _T6AINPPS_T6AINPPS1_POSITION                        0x1
#define _T6AINPPS_T6AINPPS1_SIZE                            0x1
#define _T6AINPPS_T6AINPPS1_LENGTH                          0x1
#define _T6AINPPS_T6AINPPS1_MASK                            0x2
#define _T6AINPPS_T6AINPPS2_POSN                            0x2
#define _T6AINPPS_T6AINPPS2_POSITION                        0x2
#define _T6AINPPS_T6AINPPS2_SIZE                            0x1
#define _T6AINPPS_T6AINPPS2_LENGTH                          0x1
#define _T6AINPPS_T6AINPPS2_MASK                            0x4
#define _T6AINPPS_T6AINPPS3_POSN                            0x3
#define _T6AINPPS_T6AINPPS3_POSITION                        0x3
#define _T6AINPPS_T6AINPPS3_SIZE                            0x1
#define _T6AINPPS_T6AINPPS3_LENGTH                          0x1
#define _T6AINPPS_T6AINPPS3_MASK                            0x8
#define _T6AINPPS_T6AINPPS4_POSN                            0x4
#define _T6AINPPS_T6AINPPS4_POSITION                        0x4
#define _T6AINPPS_T6AINPPS4_SIZE                            0x1
#define _T6AINPPS_T6AINPPS4_LENGTH                          0x1
#define _T6AINPPS_T6AINPPS4_MASK                            0x10

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0x1EA1);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 01EA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :5;
    };
    struct {
        unsigned CCP1PPS0               :1;
        unsigned CCP1PPS1               :1;
        unsigned CCP1PPS2               :1;
        unsigned CCP1PPS3               :1;
        unsigned CCP1PPS4               :1;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0x1EA1);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x5
#define _CCP1PPS_CCP1PPS_LENGTH                             0x5
#define _CCP1PPS_CCP1PPS_MASK                               0x1F
#define _CCP1PPS_CCP1PPS0_POSN                              0x0
#define _CCP1PPS_CCP1PPS0_POSITION                          0x0
#define _CCP1PPS_CCP1PPS0_SIZE                              0x1
#define _CCP1PPS_CCP1PPS0_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS0_MASK                              0x1
#define _CCP1PPS_CCP1PPS1_POSN                              0x1
#define _CCP1PPS_CCP1PPS1_POSITION                          0x1
#define _CCP1PPS_CCP1PPS1_SIZE                              0x1
#define _CCP1PPS_CCP1PPS1_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS1_MASK                              0x2
#define _CCP1PPS_CCP1PPS2_POSN                              0x2
#define _CCP1PPS_CCP1PPS2_POSITION                          0x2
#define _CCP1PPS_CCP1PPS2_SIZE                              0x1
#define _CCP1PPS_CCP1PPS2_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS2_MASK                              0x4
#define _CCP1PPS_CCP1PPS3_POSN                              0x3
#define _CCP1PPS_CCP1PPS3_POSITION                          0x3
#define _CCP1PPS_CCP1PPS3_SIZE                              0x1
#define _CCP1PPS_CCP1PPS3_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS3_MASK                              0x8
#define _CCP1PPS_CCP1PPS4_POSN                              0x4
#define _CCP1PPS_CCP1PPS4_POSITION                          0x4
#define _CCP1PPS_CCP1PPS4_SIZE                              0x1
#define _CCP1PPS_CCP1PPS4_LENGTH                            0x1
#define _CCP1PPS_CCP1PPS4_MASK                              0x10

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0x1EA2);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 01EA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :5;
    };
    struct {
        unsigned CCP2PPS0               :1;
        unsigned CCP2PPS1               :1;
        unsigned CCP2PPS2               :1;
        unsigned CCP2PPS3               :1;
        unsigned CCP2PPS4               :1;
    };
} CCP2PPSbits_t;
