GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.h
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x1EA2);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x5
#define _CCP2PPS_CCP2PPS_LENGTH                             0x5
#define _CCP2PPS_CCP2PPS_MASK                               0x1F
#define _CCP2PPS_CCP2PPS0_POSN                              0x0
#define _CCP2PPS_CCP2PPS0_POSITION                          0x0
#define _CCP2PPS_CCP2PPS0_SIZE                              0x1
#define _CCP2PPS_CCP2PPS0_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS0_MASK                              0x1
#define _CCP2PPS_CCP2PPS1_POSN                              0x1
#define _CCP2PPS_CCP2PPS1_POSITION                          0x1
#define _CCP2PPS_CCP2PPS1_SIZE                              0x1
#define _CCP2PPS_CCP2PPS1_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS1_MASK                              0x2
#define _CCP2PPS_CCP2PPS2_POSN                              0x2
#define _CCP2PPS_CCP2PPS2_POSITION                          0x2
#define _CCP2PPS_CCP2PPS2_SIZE                              0x1
#define _CCP2PPS_CCP2PPS2_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS2_MASK                              0x4
#define _CCP2PPS_CCP2PPS3_POSN                              0x3
#define _CCP2PPS_CCP2PPS3_POSITION                          0x3
#define _CCP2PPS_CCP2PPS3_SIZE                              0x1
#define _CCP2PPS_CCP2PPS3_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS3_MASK                              0x8
#define _CCP2PPS_CCP2PPS4_POSN                              0x4
#define _CCP2PPS_CCP2PPS4_POSITION                          0x4
#define _CCP2PPS_CCP2PPS4_SIZE                              0x1
#define _CCP2PPS_CCP2PPS4_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS4_MASK                              0x10

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
extern volatile unsigned char           CCP3PPS             __at(0x1EA3);
#ifndef _LIB_BUILD
asm("CCP3PPS equ 01EA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3PPS                :5;
    };
    struct {
        unsigned CCP3PPS0               :1;
        unsigned CCP3PPS1               :1;
        unsigned CCP3PPS2               :1;
        unsigned CCP3PPS3               :1;
        unsigned CCP3PPS4               :1;
    };
} CCP3PPSbits_t;
extern volatile CCP3PPSbits_t CCP3PPSbits __at(0x1EA3);
// bitfield macros
#define _CCP3PPS_CCP3PPS_POSN                               0x0
#define _CCP3PPS_CCP3PPS_POSITION                           0x0
#define _CCP3PPS_CCP3PPS_SIZE                               0x5
#define _CCP3PPS_CCP3PPS_LENGTH                             0x5
#define _CCP3PPS_CCP3PPS_MASK                               0x1F
#define _CCP3PPS_CCP3PPS0_POSN                              0x0
#define _CCP3PPS_CCP3PPS0_POSITION                          0x0
#define _CCP3PPS_CCP3PPS0_SIZE                              0x1
#define _CCP3PPS_CCP3PPS0_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS0_MASK                              0x1
#define _CCP3PPS_CCP3PPS1_POSN                              0x1
#define _CCP3PPS_CCP3PPS1_POSITION                          0x1
#define _CCP3PPS_CCP3PPS1_SIZE                              0x1
#define _CCP3PPS_CCP3PPS1_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS1_MASK                              0x2
#define _CCP3PPS_CCP3PPS2_POSN                              0x2
#define _CCP3PPS_CCP3PPS2_POSITION                          0x2
#define _CCP3PPS_CCP3PPS2_SIZE                              0x1
#define _CCP3PPS_CCP3PPS2_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS2_MASK                              0x4
#define _CCP3PPS_CCP3PPS3_POSN                              0x3
#define _CCP3PPS_CCP3PPS3_POSITION                          0x3
#define _CCP3PPS_CCP3PPS3_SIZE                              0x1
#define _CCP3PPS_CCP3PPS3_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS3_MASK                              0x8
#define _CCP3PPS_CCP3PPS4_POSN                              0x4
#define _CCP3PPS_CCP3PPS4_POSITION                          0x4
#define _CCP3PPS_CCP3PPS4_SIZE                              0x1
#define _CCP3PPS_CCP3PPS4_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS4_MASK                              0x10

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
extern volatile unsigned char           CCP4PPS             __at(0x1EA4);
#ifndef _LIB_BUILD
asm("CCP4PPS equ 01EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4PPS                :5;
    };
    struct {
        unsigned CCP4PPS0               :1;
        unsigned CCP4PPS1               :1;
        unsigned CCP4PPS2               :1;
        unsigned CCP4PPS3               :1;
        unsigned CCP4PPS4               :1;
    };
} CCP4PPSbits_t;
extern volatile CCP4PPSbits_t CCP4PPSbits __at(0x1EA4);
// bitfield macros
#define _CCP4PPS_CCP4PPS_POSN                               0x0
#define _CCP4PPS_CCP4PPS_POSITION                           0x0
#define _CCP4PPS_CCP4PPS_SIZE                               0x5
#define _CCP4PPS_CCP4PPS_LENGTH                             0x5
#define _CCP4PPS_CCP4PPS_MASK                               0x1F
#define _CCP4PPS_CCP4PPS0_POSN                              0x0
#define _CCP4PPS_CCP4PPS0_POSITION                          0x0
#define _CCP4PPS_CCP4PPS0_SIZE                              0x1
#define _CCP4PPS_CCP4PPS0_LENGTH                            0x1
#define _CCP4PPS_CCP4PPS0_MASK                              0x1
#define _CCP4PPS_CCP4PPS1_POSN                              0x1
#define _CCP4PPS_CCP4PPS1_POSITION                          0x1
#define _CCP4PPS_CCP4PPS1_SIZE                              0x1
#define _CCP4PPS_CCP4PPS1_LENGTH                            0x1
#define _CCP4PPS_CCP4PPS1_MASK                              0x2
#define _CCP4PPS_CCP4PPS2_POSN                              0x2
#define _CCP4PPS_CCP4PPS2_POSITION                          0x2
#define _CCP4PPS_CCP4PPS2_SIZE                              0x1
#define _CCP4PPS_CCP4PPS2_LENGTH                            0x1
#define _CCP4PPS_CCP4PPS2_MASK                              0x4
#define _CCP4PPS_CCP4PPS3_POSN                              0x3
#define _CCP4PPS_CCP4PPS3_POSITION                          0x3
#define _CCP4PPS_CCP4PPS3_SIZE                              0x1
#define _CCP4PPS_CCP4PPS3_LENGTH                            0x1
#define _CCP4PPS_CCP4PPS3_MASK                              0x8
#define _CCP4PPS_CCP4PPS4_POSN                              0x4
#define _CCP4PPS_CCP4PPS4_POSITION                          0x4
#define _CCP4PPS_CCP4PPS4_SIZE                              0x1
#define _CCP4PPS_CCP4PPS4_LENGTH                            0x1
#define _CCP4PPS_CCP4PPS4_MASK                              0x10

// Register: CCP5PPS
#define CCP5PPS CCP5PPS
extern volatile unsigned char           CCP5PPS             __at(0x1EA5);
#ifndef _LIB_BUILD
asm("CCP5PPS equ 01EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP5PPS                :6;
    };
    struct {
        unsigned CCP5PPS0               :1;
        unsigned CCP5PPS1               :1;
        unsigned CCP5PPS2               :1;
        unsigned CCP5PPS3               :1;
        unsigned CCP5PPS4               :1;
        unsigned CCP5PPS5               :1;
    };
} CCP5PPSbits_t;
