GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.h
extern volatile CCDPBbits_t CCDPBbits __at(0x1F4C);
// bitfield macros
#define _CCDPB_CCDPB0_POSN                                  0x0
#define _CCDPB_CCDPB0_POSITION                              0x0
#define _CCDPB_CCDPB0_SIZE                                  0x1
#define _CCDPB_CCDPB0_LENGTH                                0x1
#define _CCDPB_CCDPB0_MASK                                  0x1
#define _CCDPB_CCDPB1_POSN                                  0x1
#define _CCDPB_CCDPB1_POSITION                              0x1
#define _CCDPB_CCDPB1_SIZE                                  0x1
#define _CCDPB_CCDPB1_LENGTH                                0x1
#define _CCDPB_CCDPB1_MASK                                  0x2
#define _CCDPB_CCDPB2_POSN                                  0x2
#define _CCDPB_CCDPB2_POSITION                              0x2
#define _CCDPB_CCDPB2_SIZE                                  0x1
#define _CCDPB_CCDPB2_LENGTH                                0x1
#define _CCDPB_CCDPB2_MASK                                  0x4
#define _CCDPB_CCDPB3_POSN                                  0x3
#define _CCDPB_CCDPB3_POSITION                              0x3
#define _CCDPB_CCDPB3_SIZE                                  0x1
#define _CCDPB_CCDPB3_LENGTH                                0x1
#define _CCDPB_CCDPB3_MASK                                  0x8
#define _CCDPB_CCDPB4_POSN                                  0x4
#define _CCDPB_CCDPB4_POSITION                              0x4
#define _CCDPB_CCDPB4_SIZE                                  0x1
#define _CCDPB_CCDPB4_LENGTH                                0x1
#define _CCDPB_CCDPB4_MASK                                  0x10
#define _CCDPB_CCDPB5_POSN                                  0x5
#define _CCDPB_CCDPB5_POSITION                              0x5
#define _CCDPB_CCDPB5_SIZE                                  0x1
#define _CCDPB_CCDPB5_LENGTH                                0x1
#define _CCDPB_CCDPB5_MASK                                  0x20
#define _CCDPB_CCDPB6_POSN                                  0x6
#define _CCDPB_CCDPB6_POSITION                              0x6
#define _CCDPB_CCDPB6_SIZE                                  0x1
#define _CCDPB_CCDPB6_LENGTH                                0x1
#define _CCDPB_CCDPB6_MASK                                  0x40
#define _CCDPB_CCDPB7_POSN                                  0x7
#define _CCDPB_CCDPB7_POSITION                              0x7
#define _CCDPB_CCDPB7_SIZE                                  0x1
#define _CCDPB_CCDPB7_LENGTH                                0x1
#define _CCDPB_CCDPB7_MASK                                  0x80

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x1F4E);
#ifndef _LIB_BUILD
asm("ANSELC equ 01F4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSC0                  :1;
        unsigned ANSC1                  :1;
        unsigned ANSC2                  :1;
        unsigned ANSC3                  :1;
        unsigned ANSC4                  :1;
        unsigned ANSC5                  :1;
        unsigned ANSC6                  :1;
        unsigned ANSC7                  :1;
    };
} ANSELCbits_t;
extern volatile ANSELCbits_t ANSELCbits __at(0x1F4E);
// bitfield macros
#define _ANSELC_ANSC0_POSN                                  0x0
#define _ANSELC_ANSC0_POSITION                              0x0
#define _ANSELC_ANSC0_SIZE                                  0x1
#define _ANSELC_ANSC0_LENGTH                                0x1
#define _ANSELC_ANSC0_MASK                                  0x1
#define _ANSELC_ANSC1_POSN                                  0x1
#define _ANSELC_ANSC1_POSITION                              0x1
#define _ANSELC_ANSC1_SIZE                                  0x1
#define _ANSELC_ANSC1_LENGTH                                0x1
#define _ANSELC_ANSC1_MASK                                  0x2
#define _ANSELC_ANSC2_POSN                                  0x2
#define _ANSELC_ANSC2_POSITION                              0x2
#define _ANSELC_ANSC2_SIZE                                  0x1
#define _ANSELC_ANSC2_LENGTH                                0x1
#define _ANSELC_ANSC2_MASK                                  0x4
#define _ANSELC_ANSC3_POSN                                  0x3
#define _ANSELC_ANSC3_POSITION                              0x3
#define _ANSELC_ANSC3_SIZE                                  0x1
#define _ANSELC_ANSC3_LENGTH                                0x1
#define _ANSELC_ANSC3_MASK                                  0x8
#define _ANSELC_ANSC4_POSN                                  0x4
#define _ANSELC_ANSC4_POSITION                              0x4
#define _ANSELC_ANSC4_SIZE                                  0x1
#define _ANSELC_ANSC4_LENGTH                                0x1
#define _ANSELC_ANSC4_MASK                                  0x10
#define _ANSELC_ANSC5_POSN                                  0x5
#define _ANSELC_ANSC5_POSITION                              0x5
#define _ANSELC_ANSC5_SIZE                                  0x1
#define _ANSELC_ANSC5_LENGTH                                0x1
#define _ANSELC_ANSC5_MASK                                  0x20
#define _ANSELC_ANSC6_POSN                                  0x6
#define _ANSELC_ANSC6_POSITION                              0x6
#define _ANSELC_ANSC6_SIZE                                  0x1
#define _ANSELC_ANSC6_LENGTH                                0x1
#define _ANSELC_ANSC6_MASK                                  0x40
#define _ANSELC_ANSC7_POSN                                  0x7
#define _ANSELC_ANSC7_POSITION                              0x7
#define _ANSELC_ANSC7_SIZE                                  0x1
#define _ANSELC_ANSC7_LENGTH                                0x1
#define _ANSELC_ANSC7_MASK                                  0x80

// Register: WPUC
#define WPUC WPUC
extern volatile unsigned char           WPUC                __at(0x1F4F);
#ifndef _LIB_BUILD
asm("WPUC equ 01F4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUC0                  :1;
        unsigned WPUC1                  :1;
        unsigned WPUC2                  :1;
        unsigned WPUC3                  :1;
        unsigned WPUC4                  :1;
        unsigned WPUC5                  :1;
        unsigned WPUC6                  :1;
        unsigned WPUC7                  :1;
    };
} WPUCbits_t;
