GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.h
extern volatile INLVLEbits_t INLVLEbits __at(0x1F68);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x1F69);
#ifndef _LIB_BUILD
asm("IOCEP equ 01F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0x1F69);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x1F6A);
#ifndef _LIB_BUILD
asm("IOCEN equ 01F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0x1F6A);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x1F6B);
#ifndef _LIB_BUILD
asm("IOCEF equ 01F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x1F6B);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: CCDNE
#define CCDNE CCDNE
extern volatile unsigned char           CCDNE               __at(0x1F6C);
#ifndef _LIB_BUILD
asm("CCDNE equ 01F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNE0                 :1;
        unsigned CCDNE1                 :1;
        unsigned CCDNE2                 :1;
    };
} CCDNEbits_t;
extern volatile CCDNEbits_t CCDNEbits __at(0x1F6C);
// bitfield macros
#define _CCDNE_CCDNE0_POSN                                  0x0
#define _CCDNE_CCDNE0_POSITION                              0x0
#define _CCDNE_CCDNE0_SIZE                                  0x1
#define _CCDNE_CCDNE0_LENGTH                                0x1
#define _CCDNE_CCDNE0_MASK                                  0x1
#define _CCDNE_CCDNE1_POSN                                  0x1
#define _CCDNE_CCDNE1_POSITION                              0x1
#define _CCDNE_CCDNE1_SIZE                                  0x1
#define _CCDNE_CCDNE1_LENGTH                                0x1
#define _CCDNE_CCDNE1_MASK                                  0x2
#define _CCDNE_CCDNE2_POSN                                  0x2
#define _CCDNE_CCDNE2_POSITION                              0x2
#define _CCDNE_CCDNE2_SIZE                                  0x1
#define _CCDNE_CCDNE2_LENGTH                                0x1
#define _CCDNE_CCDNE2_MASK                                  0x4

// Register: CCDPE
#define CCDPE CCDPE
extern volatile unsigned char           CCDPE               __at(0x1F6D);
#ifndef _LIB_BUILD
asm("CCDPE equ 01F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPE0                 :1;
        unsigned CCDPE1                 :1;
        unsigned CCDPE2                 :1;
    };
} CCDPEbits_t;
extern volatile CCDPEbits_t CCDPEbits __at(0x1F6D);
// bitfield macros
#define _CCDPE_CCDPE0_POSN                                  0x0
#define _CCDPE_CCDPE0_POSITION                              0x0
#define _CCDPE_CCDPE0_SIZE                                  0x1
#define _CCDPE_CCDPE0_LENGTH                                0x1
#define _CCDPE_CCDPE0_MASK                                  0x1
#define _CCDPE_CCDPE1_POSN                                  0x1
#define _CCDPE_CCDPE1_POSITION                              0x1
#define _CCDPE_CCDPE1_SIZE                                  0x1
#define _CCDPE_CCDPE1_LENGTH                                0x1
#define _CCDPE_CCDPE1_MASK                                  0x2
#define _CCDPE_CCDPE2_POSN                                  0x2
#define _CCDPE_CCDPE2_POSITION                              0x2
#define _CCDPE_CCDPE2_SIZE                                  0x1
#define _CCDPE_CCDPE2_LENGTH                                0x1
#define _CCDPE_CCDPE2_MASK                                  0x4

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0x1FE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 01FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0x1FE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0x1FE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 01FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0x1FE5);
// bitfield macros
#define _WREG_SHAD_WREG_SHAD_POSN                           0x0
#define _WREG_SHAD_WREG_SHAD_POSITION                       0x0
#define _WREG_SHAD_WREG_SHAD_SIZE                           0x8
#define _WREG_SHAD_WREG_SHAD_LENGTH                         0x8
#define _WREG_SHAD_WREG_SHAD_MASK                           0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0x1FE6);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 01FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_SHAD               :6;
    };
} BSR_SHADbits_t;
extern volatile BSR_SHADbits_t BSR_SHADbits __at(0x1FE6);
// bitfield macros
#define _BSR_SHAD_BSR_SHAD_POSN                             0x0
#define _BSR_SHAD_BSR_SHAD_POSITION                         0x0
#define _BSR_SHAD_BSR_SHAD_SIZE                             0x6
#define _BSR_SHAD_BSR_SHAD_LENGTH                           0x6
#define _BSR_SHAD_BSR_SHAD_MASK                             0x3F

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0x1FE7);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 01FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH_SHAD            :7;
    };
} PCLATH_SHADbits_t;
