GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.h
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x18B8);	// @ (0x317 * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x18B9);	// @ (0x317 * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x18BA);	// @ (0x317 * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x18B7);	// @ (0x316 * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x18B4);	// @ (0x316 * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE6<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x38E2);	// @ (0x71C * 8 + 2)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR6,2)
// PMD3<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD3,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x18B0);	// @ (0x316 * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x18B1);	// @ (0x316 * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x18B2);	// @ (0x316 * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x18B3);	// @ (0x316 * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x18B5);	// @ (0x316 * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP3PPS<CCP3PPS0>
extern volatile __bit                   CCP3PPS0            __at(0xF518);	// @ (0x1EA3 * 8 + 0)
#define                                 CCP3PPS0_bit        _BIT_ACCESS(CCP3PPS,0)
// CCP3PPS<CCP3PPS1>
extern volatile __bit                   CCP3PPS1            __at(0xF519);	// @ (0x1EA3 * 8 + 1)
#define                                 CCP3PPS1_bit        _BIT_ACCESS(CCP3PPS,1)
// CCP3PPS<CCP3PPS2>
extern volatile __bit                   CCP3PPS2            __at(0xF51A);	// @ (0x1EA3 * 8 + 2)
#define                                 CCP3PPS2_bit        _BIT_ACCESS(CCP3PPS,2)
// CCP3PPS<CCP3PPS3>
extern volatile __bit                   CCP3PPS3            __at(0xF51B);	// @ (0x1EA3 * 8 + 3)
#define                                 CCP3PPS3_bit        _BIT_ACCESS(CCP3PPS,3)
// CCP3PPS<CCP3PPS4>
extern volatile __bit                   CCP3PPS4            __at(0xF51C);	// @ (0x1EA3 * 8 + 4)
#define                                 CCP3PPS4_bit        _BIT_ACCESS(CCP3PPS,4)
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x18D8);	// @ (0x31B * 8 + 0)
#define                                 CCP4CTS0_bit        _BIT_ACCESS(CCP4CAP,0)
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x18D9);	// @ (0x31B * 8 + 1)
#define                                 CCP4CTS1_bit        _BIT_ACCESS(CCP4CAP,1)
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x18DA);	// @ (0x31B * 8 + 2)
#define                                 CCP4CTS2_bit        _BIT_ACCESS(CCP4CAP,2)
// CCP4CON<CCP4EN>
extern volatile __bit                   CCP4EN              __at(0x18D7);	// @ (0x31A * 8 + 7)
#define                                 CCP4EN_bit          _BIT_ACCESS(CCP4CON,7)
// CCP4CON<CCP4FMT>
extern volatile __bit                   CCP4FMT             __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 CCP4FMT_bit         _BIT_ACCESS(CCP4CON,4)
// PIE6<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x38E3);	// @ (0x71C * 8 + 3)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE6,3)
// PIR6<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x3893);	// @ (0x712 * 8 + 3)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR6,3)
// PMD3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD3,3)
// CCP4CON<CCP4MODE0>
extern volatile __bit                   CCP4MODE0           __at(0x18D0);	// @ (0x31A * 8 + 0)
#define                                 CCP4MODE0_bit       _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4MODE1>
extern volatile __bit                   CCP4MODE1           __at(0x18D1);	// @ (0x31A * 8 + 1)
#define                                 CCP4MODE1_bit       _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4MODE2>
extern volatile __bit                   CCP4MODE2           __at(0x18D2);	// @ (0x31A * 8 + 2)
#define                                 CCP4MODE2_bit       _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4MODE3>
extern volatile __bit                   CCP4MODE3           __at(0x18D3);	// @ (0x31A * 8 + 3)
#define                                 CCP4MODE3_bit       _BIT_ACCESS(CCP4CON,3)
// CCP4CON<CCP4OUT>
extern volatile __bit                   CCP4OUT             __at(0x18D5);	// @ (0x31A * 8 + 5)
#define                                 CCP4OUT_bit         _BIT_ACCESS(CCP4CON,5)
// CCP4PPS<CCP4PPS0>
extern volatile __bit                   CCP4PPS0            __at(0xF520);	// @ (0x1EA4 * 8 + 0)
#define                                 CCP4PPS0_bit        _BIT_ACCESS(CCP4PPS,0)
// CCP4PPS<CCP4PPS1>
extern volatile __bit                   CCP4PPS1            __at(0xF521);	// @ (0x1EA4 * 8 + 1)
#define                                 CCP4PPS1_bit        _BIT_ACCESS(CCP4PPS,1)
// CCP4PPS<CCP4PPS2>
extern volatile __bit                   CCP4PPS2            __at(0xF522);	// @ (0x1EA4 * 8 + 2)
#define                                 CCP4PPS2_bit        _BIT_ACCESS(CCP4PPS,2)
// CCP4PPS<CCP4PPS3>
extern volatile __bit                   CCP4PPS3            __at(0xF523);	// @ (0x1EA4 * 8 + 3)
#define                                 CCP4PPS3_bit        _BIT_ACCESS(CCP4PPS,3)
// CCP4PPS<CCP4PPS4>
extern volatile __bit                   CCP4PPS4            __at(0xF524);	// @ (0x1EA4 * 8 + 4)
#define                                 CCP4PPS4_bit        _BIT_ACCESS(CCP4PPS,4)
// CCP5CAP<CCP5CTS0>
extern volatile __bit                   CCP5CTS0            __at(0x18F8);	// @ (0x31F * 8 + 0)
#define                                 CCP5CTS0_bit        _BIT_ACCESS(CCP5CAP,0)
// CCP5CAP<CCP5CTS1>
extern volatile __bit                   CCP5CTS1            __at(0x18F9);	// @ (0x31F * 8 + 1)
#define                                 CCP5CTS1_bit        _BIT_ACCESS(CCP5CAP,1)
// CCP5CAP<CCP5CTS2>
extern volatile __bit                   CCP5CTS2            __at(0x18FA);	// @ (0x31F * 8 + 2)
#define                                 CCP5CTS2_bit        _BIT_ACCESS(CCP5CAP,2)
// CCP5CON<CCP5EN>
extern volatile __bit                   CCP5EN              __at(0x18F7);	// @ (0x31E * 8 + 7)
#define                                 CCP5EN_bit          _BIT_ACCESS(CCP5CON,7)
// CCP5CON<CCP5FMT>
extern volatile __bit                   CCP5FMT             __at(0x18F4);	// @ (0x31E * 8 + 4)
#define                                 CCP5FMT_bit         _BIT_ACCESS(CCP5CON,4)
// PIE6<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE6,4)
// PIR6<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x3894);	// @ (0x712 * 8 + 4)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR6,4)
// PMD3<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD3,4)
// CCP5CON<CCP5MODE0>
extern volatile __bit                   CCP5MODE0           __at(0x18F0);	// @ (0x31E * 8 + 0)
#define                                 CCP5MODE0_bit       _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5MODE1>
extern volatile __bit                   CCP5MODE1           __at(0x18F1);	// @ (0x31E * 8 + 1)
#define                                 CCP5MODE1_bit       _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5MODE2>
extern volatile __bit                   CCP5MODE2           __at(0x18F2);	// @ (0x31E * 8 + 2)
#define                                 CCP5MODE2_bit       _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5MODE3>
extern volatile __bit                   CCP5MODE3           __at(0x18F3);	// @ (0x31E * 8 + 3)
#define                                 CCP5MODE3_bit       _BIT_ACCESS(CCP5CON,3)
// CCP5CON<CCP5OUT>
extern volatile __bit                   CCP5OUT             __at(0x18F5);	// @ (0x31E * 8 + 5)
#define                                 CCP5OUT_bit         _BIT_ACCESS(CCP5CON,5)
// CCP5PPS<CCP5PPS0>
extern volatile __bit                   CCP5PPS0            __at(0xF528);	// @ (0x1EA5 * 8 + 0)
#define                                 CCP5PPS0_bit        _BIT_ACCESS(CCP5PPS,0)
// CCP5PPS<CCP5PPS1>
extern volatile __bit                   CCP5PPS1            __at(0xF529);	// @ (0x1EA5 * 8 + 1)
#define                                 CCP5PPS1_bit        _BIT_ACCESS(CCP5PPS,1)
// CCP5PPS<CCP5PPS2>
extern volatile __bit                   CCP5PPS2            __at(0xF52A);	// @ (0x1EA5 * 8 + 2)
#define                                 CCP5PPS2_bit        _BIT_ACCESS(CCP5PPS,2)
// CCP5PPS<CCP5PPS3>
extern volatile __bit                   CCP5PPS3            __at(0xF52B);	// @ (0x1EA5 * 8 + 3)
#define                                 CCP5PPS3_bit        _BIT_ACCESS(CCP5PPS,3)
// CCP5PPS<CCP5PPS4>
extern volatile __bit                   CCP5PPS4            __at(0xF52C);	// @ (0x1EA5 * 8 + 4)
#define                                 CCP5PPS4_bit        _BIT_ACCESS(CCP5PPS,4)
// CCP5PPS<CCP5PPS5>
extern volatile __bit                   CCP5PPS5            __at(0xF52D);	// @ (0x1EA5 * 8 + 5)
#define                                 CCP5PPS5_bit        _BIT_ACCESS(CCP5PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x4862);	// @ (0x90C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x4863);	// @ (0x90C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x4473);	// @ (0x88E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0xC7E);	// @ (0x18F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0xCCE);	// @ (0x199 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0xCD4);	// @ (0x19A * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// PIE5<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x38DC);	// @ (0x71B * 8 + 4)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x388C);	// @ (0x711 * 8 + 4)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR5,4)
// PMD5<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x3CD9);	// @ (0x79B * 8 + 1)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD5,1)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x38DD);	// @ (0x71B * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x388D);	// @ (0x711 * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// PMD5<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD5,2)
// PIE5<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x38DE);	// @ (0x71B * 8 + 6)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x388E);	// @ (0x711 * 8 + 6)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR5,6)
// PMD5<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x3CDB);	// @ (0x79B * 8 + 3)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD5,3)
// PIE5<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x38DF);	// @ (0x71B * 8 + 7)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x388F);	// @ (0x711 * 8 + 7)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR5,7)
// PMD5<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x3CDC);	// @ (0x79B * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD5,4)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0xF5D8);	// @ (0x1EBB * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0xF5D9);	// @ (0x1EBB * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0xF5DA);	// @ (0x1EBB * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0xF5DB);	// @ (0x1EBB * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0xF5DC);	// @ (0x1EBB * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0xF5E0);	// @ (0x1EBC * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0xF5E1);	// @ (0x1EBC * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0xF5E2);	// @ (0x1EBC * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0xF5E3);	// @ (0x1EBC * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0xF5E4);	// @ (0x1EBC * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0xF5E8);	// @ (0x1EBD * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0xF5E9);	// @ (0x1EBD * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0xF5EA);	// @ (0x1EBD * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0xF5EB);	// @ (0x1EBD * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0xF5EC);	// @ (0x1EBD * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0xF5F0);	// @ (0x1EBE * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0xF5F1);	// @ (0x1EBE * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0xF5F2);	// @ (0x1EBE * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF5F3);	// @ (0x1EBE * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF5F4);	// @ (0x1EBE * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x44B3);	// @ (0x896 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x44AB);	// @ (0x895 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x44A8);	// @ (0x895 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x44A9);	// @ (0x895 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x44AA);	// @ (0x895 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x44AF);	// @ (0x895 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
